[
  {
    "Barbell Bench Press": "The bench press, or chest press, is an upper-body weight training exercise in which the trainee presses a weight upwards while lying on a weight training bench. The exercise uses the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.",
    "Dumbell Bench Press": "The bench press, or chest press, is an upper-body weight training exercise in which the trainee presses a weight upwards while lying on a weight training bench. The exercise uses the pectoralis major, the anterior deltoids, and the triceps, among other stabilizing muscles. A barbell is generally used to hold the weight, but a pair of dumbbells can also be used.",
    "Barbell Incline Bench Press": "The incline barbell press is a free weight exercise designed to target the chest, shoulders, and triceps, hitting each side of the body independently. Unlike the more traditional flat bench press, the incline press shifts the focus of the movement to the upper portion of the pectoral muscle groups and the front of the shoulder. This allows for greater hypertrophy (muscle growth) of the upper chest when the exercise is performed regularly.",
    "Dumbell Incline Bench Press": "The incline dumbell press is a free weight exercise designed to target the chest, shoulders, and triceps, hitting each side of the body independently. Unlike the more traditional flat bench press, the incline press shifts the focus of the movement to the upper portion of the pectoral muscle groups and the front of the shoulder. This allows for greater hypertrophy (muscle growth) of the upper chest when the exercise is performed regularly.",
    "Barbell Decline Bench Press": "In a decline bench press, the bench is set to 15 to 30 degrees on a decline. This angle places your upper body on a downward slope, which activates the lower pectoral muscles as you push weights away from your body.",
    "Dumbell Decline Bench Press": "In a decline bench press, the bench is set to 15 to 30 degrees on a decline. This angle places your upper body on a downward slope, which activates the lower pectoral muscles as you push weights away from your body.",
    "Skullcrushers": "The skull crusher is a push exercise that isolates the triceps brachii, working it from the elbow all the way up to the latissimus dorsi muscle of the back.",
    "Overhead Extension": "The cable rope overhead triceps extension exercise works the tricep muscle by reaching behind your neck and helping build stronger and bigger arms.",
    "Tricep Pushdown": "A tricep pushdown is an isolation exercise designed to target your triceps muscles. Perform tricep pushdowns by standing in front of a pulley machine with your feet shoulder-width apart. Grab hold of the cable attachment on the pulley machine. This attachment can be fitted with a rope, a straight bar, or a V-bar. Keep your upper body aligned as you pull down on the cable attachment through a full range of motion in your elbows.",
    "Push-Up": "A push-up (sometimes called a press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole.",
    "Weighted Push-Up": "Progressively overloading classic push-ups using barbell plates, resistance bands or any form of weight. The load is usually positioned on the upper back.",
    "Cable Chest Fly": "The standing cable fly is a variation of the chest fly and an exercise used to strengthen the pushing muscles of the body including the chest, triceps, and shoulders.",
    "Dumbell Chest Fly": "The dumbbell chest fly is an upper body exercise that can help to strengthen the chest and shoulders. The traditional way to perform a dumbbell chest fly is to do the move while lying on your back on a flat or incline bench. There’s also a standing variation.",
    "Dip": "A dip is an upper-body strength exercise. Narrow, shoulder-width dips only train the triceps, with major synergists being the anterior deltoid, the pectoralis muscles (sternal, clavicular, and minor), and the rhomboid muscles of the back (in that order).",
    "Weighted Dip": "A dip is an upper-body strength exercise. Narrow, shoulder-width dips only train the triceps, with major synergists being the anterior deltoid, the pectoralis muscles (sternal, clavicular, and minor), and the rhomboid muscles of the back (in that order)",
    "Barbell Deadlift": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground. Although this exercise uses the legs and hips as the primary movers, it can also be considered a back exercise.",
    "Good Mornings": "The good morning exercise works the hamstrings, back, glutes, and abs. Using a weighted barbell increases the load on these muscles, though beginners should start with a light weight (or no weight at all).",
    "Lower Back Extension": "The back extension machine or Roman chair is used for an isolation exercise that targets the lower-back muscles, primarily the erector spinae.1 You lock your heels under a pad or roller with another pad to support your lower body as you recline face-down.",
    "Trap Bar Deadlift": "The trap bar deadlift is a variation of the deadlift using a special hexagonal bar (a trap bar). This allows more clearance for the knees to pass through the bar. he trap bar deadlift allows for greater amounts of peak force production meaning it can be performed more powerfully. This allows for a greater amount of weight to be lifted than in a traditional barbell deadlift. It also reduces the potential for injury by avoiding excessive strain on the lower back. This is especially advantageous for beginners.",
    "Lat Pulldown": "The pull-down exercise is a strength training exercise designed to develop the latissimus dorsi muscle. It performs the functions of downward rotation and depression of the scapulae combined with adduction and extension of the shoulder joint.",
    "Seated Cable Row": "Seated cable rows focuses on back muscles (such as trapezius and lat muscles). It also helps to develop the strength in the muscles of the biceps, forearms and shoulders. If you do not have a cable machine, athletes often use the alternative known as Dumbbell Rows.",
    "T-Bar Row": "The T-Bar row, also known as the close grip barbell row, is an excellent exercise to use if you are trying to target your upper back. A variation of the bent over row, the T-bar row allows one to utilize a more neutral grip which can help alleviate some of the tension placed on the shoulder joint.",
    "Barbell Curl": "A weight training exercise intended to develop the biceps brachii’s size, endurance or strength, in which a dumbbell or similar weighted object is held in the hand with the arm extended and lifted to complete flexion of the arm at the elbow or, when developing both biceps brachii, using a barbell to perform the same movement with both arms.",
    "Dumbell Curl": "A weight training exercise intended to develop the biceps brachii’s size, endurance or strength, in which a dumbbell or similar weighted object is held in the hand with the arm extended and lifted to complete flexion of the arm at the elbow or, when developing both biceps brachii, using a barbell to perform the same movement with both arms.",
    "Rear Delt Fly": "The rear delt fly, also known as the rear delt raise or the bent-over dumbbell reverse fly, is a weight training exercise that targets your upper back muscles and shoulder muscles, particularly the posterior deltoids, or rear deltoids, on the backside of your shoulders. Rear delt flys are useful isolation exercises that can prepare you for more complex compound exercises like deadlifts, bench presses, and inverted rows.",
    "Pull-Up": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands and pulls up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso.",
    "Weighted Pull-Up": "A pull-up is an upper-body strength exercise. The pull-up is a closed-chain movement where the body is suspended by the hands and pulls up. As this happens, the elbows flex and the shoulders adduct and extend to bring the elbows to the torso. Weight is added using a dipping belt, or grasping a dumbbell with the feet, or weight vest/shorts.",
    "Back Squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent of a squat, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. The bar is held on the back of the body upon the upper trapezius muscle, near to the base of the neck.",
    "Front Squat": "A squat is a strength exercise in which the trainee lowers their hips from a standing position and then stands back up. During the descent of a squat, the hip and knee joints flex while the ankle joint dorsiflexes; conversely the hip and knee joints extend and the ankle joint plantarflexes when standing up. The barbell is held in front of the body across the clavicles and deltoids in either a clean grip, as is used in weightlifting, or with the arms crossed and hands placed on top of the barbell.",
    "Goblet Squat": "A squat performed while holding a dumbell or kettlebell next to one's chest and abdomen with both hands.",
    "Calf Raise": "Standing calf raises activate the two muscles that run down the back of the lower leg: the gastrocnemius and soleus. These muscles are integral in ankle flexion and extension, propelling running and jumping.",
    "Leg Press": "The leg press is a compound weight training exercise in which the individual pushes a weight or resistance away from them using their legs. The term leg press machine refers to the apparatus used to perform this exercise.",
    "Leg Extension": "The leg extension, or knee extension, is a type of strength training exercise. It’s an excellent move for strengthening your quadriceps, which are in the front of your upper legs. Leg extensions are done on a leg extension machine. You sit on the machine with a weighted pad on top of your lower legs. Then you use your quads to repeatedly extend your knees and lift your lower legs.",
    "Leg Curl": "An exercise, usually performed lying on the stomach with weights, in which one lifts one or both heels towards the buttocks and then returns to the starting position, while the rest of the body is kept immobile. Designed to strengthen the flexor muscles of the leg",
    "Hip Abduction": "Hip abduction refers to the movement of the hip joint as the leg is moved away from the midline of the body. As the hip is composed of a ball and socket joint, a degree of rotation is also present during this motion. A group of muscles contribute to hip abduction; the most important of these is the gluteus medius.",
    "Hip Adduction": "Hip adductors are the muscles in your inner thigh that support balance and alignment. These stabilizing muscles are used to adduct the hips and thighs or move them toward the midline of your body.",
    "Barbell Shoulder Press": "The barbell shoulder press targets the deltoids and trapezius muscles, along with all of the smaller, deeper muscles that make up your shoulders. You’ll also engage your triceps, biceps, back, and core for greater overall body strength.",
    "Dumbell Shoulder Press": "The barbell shoulder press targets the deltoids and trapezius muscles, along with all of the smaller, deeper muscles that make up your shoulders. You’ll also engage your triceps, biceps, back, and core for greater overall body strength. Using dumbbells in place of a barbell is a great option for those who can’t yet lift the weight of the barbell—which is usually 45 pounds in most gyms—or who feel pain in their shoulders when pressing upward with a barbell.",
    "Lateral Raise": "A lateral raise is a strength training shoulder exercise characterized by lifting a pair of dumbbells away from your body in an external rotation. Lateral raises work the trapezius muscle in your upper back as well as the deltoid muscle group in your shoulders—particularly the anterior and lateral deltoids.",
    "Chest Press": "The chest press strength training exercise works the pectoral muscles of the chest. You can use a variety of equipment, including dumbbells, barbells, a Smith machine, suspension trainer, or even resistance bands, to perform a chest press.",
    "Wrist Curl": "The wrist curl is a weight training exercise for developing just the wrist flexor muscles of the forearm. Wrist curls can be performed with a dumbbell or with both hands holding a barbell. To perform a seated wrist curl, the lifter should be seated on a bench with knees bent and the forearm(s) resting on the thigh, or with forearms on a bench and hands hanging off the edge.",
    "Sit-Ups": "The sit-up (or curl-up) is an abdominal endurance training exercise to strengthen, tighten and tone the abdominal muscles. It is similar to a crunch (crunches target the rectus abdominis and also work the biceps and external and internal obliques), but sit-ups have a fuller range of motion and condition additional muscles.",
    "Crunches": "The crunch is one of the most popular abdominal exercises. When performed properly, it engages all the abdominal muscles but primarily it works the rectus abdominis muscle and the obliques. It allows both building six-pack abs, and tightening the belly.",
    "Russian Twists": "The Russian twist is a simple abdominal exercise for working the core, shoulders, and hips. It is typically performed in repetitive sets and tones the core muscles via a twisting motion focused around the abdomen. The exercise can help build strength in the upper torso.",
    "Shrugs": "The shoulder shrug (usually called simply the shrug) is an exercise in weight training used to develop the upper trapezius muscle. A barbell, dumbbells, trap bar, resistance bands Parallel bars, or a Smith machine may be used for resistance, and overhand, inside, outside, underhand or mixed grip can be used."
  }
]
